{"id":142,"date":"2020-10-16T06:10:00","date_gmt":"2020-10-16T06:10:00","guid":{"rendered":"http:\/\/localhost\/test\/index.php\/2020\/10\/16\/pregnant-kareena-kapoor-wraps-up-laal-singh-chaddha-delhi-shoot-with-special-precautions\/"},"modified":"2020-10-16T06:10:00","modified_gmt":"2020-10-16T06:10:00","slug":"pregnant-kareena-kapoor-wraps-up-laal","status":"publish","type":"post","link":"http:\/\/localhost\/test\/2020\/10\/pregnant-kareena-kapoor-wraps-up-laal\/","title":{"rendered":"Pregnant Kareena Kapoor wraps up Laal Singh Chaddha Delhi shoot with special precautions"},"content":{"rendered":"<p>&nbsp;<\/p>\n<div style=\"clear: both; text-align: center;\"><a href=\"https:\/\/1.bp.blogspot.com\/-VcKtbXQMrsM\/X5vrHhMyQfI\/AAAAAAAAFEU\/6-Gs_3DRJDgddSWY1MmP2XRqx9AOHjjoACLcBGAsYHQ\/s320\/Kareena-Kapoor-Khan-pregnancy-in-denim-shirt-black-leggings-hairband-walk-Mumbai.jpg\" style=\"margin-left: 1em; margin-right: 1em;\"><img decoding=\"async\" border=\"0\" data-original-height=\"320\" data-original-width=\"228\" src=\"https:\/\/1.bp.blogspot.com\/-VcKtbXQMrsM\/X5vrHhMyQfI\/AAAAAAAAFEU\/6-Gs_3DRJDgddSWY1MmP2XRqx9AOHjjoACLcBGAsYHQ\/s0\/Kareena-Kapoor-Khan-pregnancy-in-denim-shirt-black-leggings-hairband-walk-Mumbai.jpg\" \/><\/a><\/div>\n<p><\/p>\n<div style=\"clear: both; text-align: center;\"><span style=\"text-align: left;\"><br \/><\/span><\/div>\n<div style=\"clear: both; text-align: center;\"><span style=\"text-align: left;\"><span style=\"font-size: medium;\">As the entertainment world is gradually, yet consistently moving back to work, Kareena Kapoor has wrapped up her aspect of the go for her forthcoming film Laal Singh Chaddha. The film is being helmed by Advait Chandan and furthermore stars Aamir Khan ahead of the pack job. The much-anticipated film is the Hindi redo of the 1994 Hollywood work of art, Forrest Gump, which featured Tom Hanks in an important job.&nbsp;<\/span><\/span><\/div>\n<p><span style=\"font-size: medium;\"><\/span><\/p>\n<p><a name='more'><\/a><\/p>\n<p><span style=\"font-size: medium;\">Kareena Kapoor took to her Instagram handle to share the flock of feelings that accompanied the finish of the film&#8217;s shoot. She imparted an image to Aamir Khan and expressed, &#8220;And all excursions must reach a conclusion. Today, I wrapped my film Laal Singh Chaddha&#8230; difficult stretches&#8230; the pandemic, my pregnancy, apprehension however literally nothing could stop the energy with which we shot, with all security measures ofcourse. Much obliged to you @_aamirkhan and @advaitchandan for an extraordinary yet impactful excursion&#8230; much obliged to you to my most superb group @avancontractor, @teasemakeup, @makeupbypompy, @poonamdamania and the whole team&#8230; @nainas89 you were missed.&#8221; She closed, &#8220;Till we run into each other once more&#8230; (sic).&#8221; Take a look:&nbsp;<\/span><\/p>\n<p><span style=\"font-size: medium;\">Kareena had left to shoot her successions in Delhi during the most recent seven day stretch of September. On Wednesday, she wrapped up the rest of the bits which had been postponed on account on novel Covid pandemic.&nbsp;<\/span><\/p>\n<p><span style=\"font-size: medium;\">In these phenomenal occasions, additional insurances are being assumed the arrangements of each film. Kareena additionally adjusted to this new ordinary and shot the film following all the important rules. Extraordinary safeguards were taken during the shoot of Laal Singh Chaddha as Kareena is pregnant. Aamir khan had additionally continued shooting of the film in the ongoing past.&nbsp;<\/span><\/p>\n<p><span style=\"font-size: medium;\">It was a year ago when Aamir had uncovered Kareena Kapoor&#8217;s first look from Laal Singh Chaddha on Instagram. The entertainer looked shocking wearing a salwar kameez. From that point forward, fans have been anxiously sitting tight for refreshes on the film.&nbsp;<\/span><\/p>\n<p><span style=\"font-size: medium;\">Prior, the film was booked to deliver on December 25 this year. In November 2019, Aamir Khan took to web-based media to uncover the delivery date of Laal Singh Chaddha. Nonetheless, as the shooting of the film was ended because of Covid-19, the producers chose to deliver it on Christmas one year from now. Aamir Khan had taken shots at Amritsar, Chandigarh, Kolkata and Himachal Pradesh for the film before the creation was slowed down because of the continuous pandemic.<\/span><\/p>\n","protected":false},"excerpt":{"rendered":"<p>&nbsp; As the entertainment world is gradually, yet consistently moving back to work, Kareena Kapoor has wrapped up her aspect of the go for her forthcoming film Laal Singh Chaddha. The film is being helmed by Advait Chandan and furthermore stars Aamir Khan ahead of the pack job. The much-anticipated film is the Hindi redo [&hellip;]<\/p>\n","protected":false},"author":1,"featured_media":0,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[6],"tags":[],"_links":{"self":[{"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/posts\/142"}],"collection":[{"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/comments?post=142"}],"version-history":[{"count":0,"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/posts\/142\/revisions"}],"wp:attachment":[{"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/media?parent=142"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/categories?post=142"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/localhost\/test\/wp-json\/wp\/v2\/tags?post=142"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}